; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite7 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	image1 - mode
	infrared0 - mode
	thermograph3 - mode
	spectrograph2 - mode
	thermograph4 - mode
	Star3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
	Planet23 - direction
	Planet24 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star19)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star4)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph4)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph3)
	(supports instrument5 image1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star19)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument7 thermograph3)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star3)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon9)
	(supports instrument10 thermograph4)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 infrared0)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 infrared0)
	(calibration_target instrument12 Star1)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet6)
	(supports instrument13 thermograph3)
	(supports instrument13 infrared0)
	(calibration_target instrument13 Star3)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 GroundStation2)
	(supports instrument15 thermograph4)
	(calibration_target instrument15 GroundStation0)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet17)
	(supports instrument16 thermograph4)
	(calibration_target instrument16 GroundStation2)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 Star1)
	(supports instrument18 thermograph4)
	(calibration_target instrument18 Star4)
	(on_board instrument16 satellite7)
	(on_board instrument17 satellite7)
	(on_board instrument18 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet11)
)
(:goal (and
	(pointing satellite0 Star19)
	(pointing satellite1 Planet22)
	(pointing satellite2 Star13)
	(pointing satellite3 Planet14)
	(pointing satellite5 Planet24)
	(pointing satellite7 Star3)
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Planet7 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image1)
	(have_image Star12 thermograph3)
	(have_image Star13 thermograph3)
	(have_image Planet14 thermograph4)
	(have_image Star15 thermograph4)
	(have_image Phenomenon16 image1)
	(have_image Planet17 thermograph3)
	(have_image Star18 image1)
	(have_image Planet20 image1)
	(have_image Planet21 infrared0)
	(have_image Planet22 image1)
	(have_image Planet23 thermograph3)
	(have_image Planet24 infrared0)
))

(:metric minimize (total-time))
)

; plan
1. (switch-on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 1 of 24
2. (turn-to satellite4 groundstation2 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 groundstation2)
   goals met: 1 of 24
3. (calibrate satellite4 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 1 of 24
4. (turn-to satellite4 phenomenon10 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon10)
   goals met: 1 of 24
5. (take-image satellite4 phenomenon10 instrument8 image1)
   added: (have_image phenomenon10 image1)
   goals met: 2 of 24
6. (turn-to satellite4 planet11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet11)
   goals met: 2 of 24
7. (take-image satellite4 planet11 instrument8 image1)
   added: (have_image planet11 image1)
   goals met: 3 of 24
8. (turn-to satellite4 phenomenon16 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 phenomenon16)
   goals met: 3 of 24
9. (take-image satellite4 phenomenon16 instrument8 image1)
   added: (have_image phenomenon16 image1)
   goals met: 4 of 24
10. (turn-to satellite4 star18 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 star18)
   goals met: 4 of 24
11. (take-image satellite4 star18 instrument8 image1)
   added: (have_image star18 image1)
   goals met: 5 of 24
12. (turn-to satellite4 planet20 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 planet20)
   goals met: 5 of 24
13. (take-image satellite4 planet20 instrument8 image1)
   added: (have_image planet20 image1)
   goals met: 6 of 24
14. (turn-to satellite4 planet22 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet22)
   goals met: 6 of 24
15. (take-image satellite4 planet22 instrument8 image1)
   added: (have_image planet22 image1)
   goals met: 7 of 24
16. (switch-on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 7 of 24
17. (turn-to satellite2 star1 star19)
   deleted: (pointing satellite2 star19)
   added: (pointing satellite2 star1)
   goals met: 7 of 24
18. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 7 of 24
19. (turn-to satellite2 planet17 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet17)
   goals met: 7 of 24
20. (take-image satellite2 planet17 instrument4 thermograph3)
   added: (have_image planet17 thermograph3)
   goals met: 8 of 24
21. (turn-to satellite2 planet6 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 planet6)
   goals met: 8 of 24
22. (take-image satellite2 planet6 instrument4 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 9 of 24
23. (turn-to satellite2 star12 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star12)
   goals met: 9 of 24
24. (take-image satellite2 star12 instrument4 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 10 of 24
25. (turn-to satellite2 star13 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star13)
   goals met: 11 of 24
26. (take-image satellite2 star13 instrument4 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 12 of 24
27. (turn-to satellite2 planet23 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 planet23)
   goals met: 11 of 24
28. (take-image satellite2 planet23 instrument4 thermograph3)
   added: (have_image planet23 thermograph3)
   goals met: 12 of 24
29. (turn-to satellite2 planet14 planet23)
   deleted: (pointing satellite2 planet23)
   added: (pointing satellite2 planet14)
   goals met: 12 of 24
30. (take-image satellite2 planet14 instrument4 thermograph4)
   added: (have_image planet14 thermograph4)
   goals met: 13 of 24
31. (turn-to satellite2 star15 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star15)
   goals met: 13 of 24
32. (take-image satellite2 star15 instrument4 thermograph4)
   added: (have_image star15 thermograph4)
   goals met: 14 of 24
33. (switch-on instrument11 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument11)
   goals met: 14 of 24
34. (turn-to satellite5 groundstation0 planet6)
   deleted: (pointing satellite5 planet6)
   added: (pointing satellite5 groundstation0)
   goals met: 14 of 24
35. (calibrate satellite5 instrument11 groundstation0)
   added: (calibrated instrument11)
   goals met: 14 of 24
36. (turn-to satellite5 planet7 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 planet7)
   goals met: 14 of 24
37. (take-image satellite5 planet7 instrument11 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 15 of 24
38. (turn-to satellite5 planet21 planet7)
   deleted: (pointing satellite5 planet7)
   added: (pointing satellite5 planet21)
   goals met: 15 of 24
39. (take-image satellite5 planet21 instrument11 infrared0)
   added: (have_image planet21 infrared0)
   goals met: 16 of 24
40. (turn-to satellite5 phenomenon9 planet21)
   deleted: (pointing satellite5 planet21)
   added: (pointing satellite5 phenomenon9)
   goals met: 16 of 24
41. (take-image satellite5 phenomenon9 instrument11 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 17 of 24
42. (turn-to satellite5 planet24 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 planet24)
   goals met: 18 of 24
43. (take-image satellite5 planet24 instrument11 infrared0)
   added: (have_image planet24 infrared0)
   goals met: 19 of 24
44. (turn-to satellite2 phenomenon5 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 phenomenon5)
   goals met: 19 of 24
45. (take-image satellite2 phenomenon5 instrument4 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 20 of 24
46. (turn-to satellite2 star13 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star13)
   goals met: 21 of 24
47. (turn-to satellite1 planet22 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 planet22)
   goals met: 22 of 24
48. (turn-to satellite7 star3 planet11)
   deleted: (pointing satellite7 planet11)
   added: (pointing satellite7 star3)
   goals met: 23 of 24
49. (turn-to satellite3 planet14 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 planet14)
   goals met: 24 of 24
